HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxScu_regdef.h
/** \\brief  Die Temperature Sensor Status Register */
typedef struct _Ifx_SCU_DTSSTAT_Bits
{
    unsigned int RESULT:10;                 /**< \brief [9:0] Result of the DTS Measurement (rh) */
    unsigned int reserved_10:4;             /**< \brief \internal Reserved */
    unsigned int RDY:1;                     /**< \brief [14:14] Sensor Ready Status (rh) */
    unsigned int BUSY:1;                    /**< \brief [15:15] Sensor Busy Status (rh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_SCU_DTSSTAT_Bits;

/** \\brief  External Input Channel Register */
typedef struct _Ifx_SCU_EICR_Bits
{
    unsigned int reserved_0:4;              /**< \brief \internal Reserved */
    unsigned int EXIS0:3;                   /**< \brief [6:4] External Input Selection 0 (rw) */
    unsigned int reserved_7:1;              /**< \brief \internal Reserved */
    unsigned int FEN0:1;                    /**< \brief [8:8] Falling Edge Enable 0 (rw) */
    unsigned int REN0:1;                    /**< \brief [9:9] Rising Edge Enable 0 (rw) */
    unsigned int LDEN0:1;                   /**< \brief [10:10] Level Detection Enable 0 (rw) */
    unsigned int EIEN0:1;                   /**< \brief [11:11] External Input Enable 0 (rw) */
    unsigned int INP0:3;                    /**< \brief [14:12] Input Node Pointer (rw) */
    unsigned int reserved_15:5;             /**< \brief \internal Reserved */
    unsigned int EXIS1:3;                   /**< \brief [22:20] External Input Selection 1 (rw) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int FEN1:1;                    /**< \brief [24:24] Falling Edge Enable 1 (rw) */
    unsigned int REN1:1;                    /**< \brief [25:25] Rising Edge Enable 1 (rw) */
    unsigned int LDEN1:1;                   /**< \brief [26:26] Level Detection Enable 1 (rw) */
    unsigned int EIEN1:1;                   /**< \brief [27:27] External Input Enable 1 (rw) */
    unsigned int INP1:3;                    /**< \brief [30:28] Input Node Pointer (rw) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_SCU_EICR_Bits;

/** \\brief  External Input Flag Register */
typedef struct _Ifx_SCU_EIFR_Bits
{
    unsigned int INTF0:1;                   /**< \brief [0:0] External Event Flag of Channel 0 (rh) */
    unsigned int INTF1:1;                   /**< \brief [1:1] External Event Flag of Channel 1 (rh) */
    unsigned int INTF2:1;                   /**< \brief [2:2] External Event Flag of Channel 2 (rh) */
    unsigned int INTF3:1;                   /**< \brief [3:3] External Event Flag of Channel 3 (rh) */
    unsigned int INTF4:1;                   /**< \brief [4:4] External Event Flag of Channel 4 (rh) */
    unsigned int INTF5:1;                   /**< \brief [5:5] External Event Flag of Channel 5 (rh) */
    unsigned int INTF6:1;                   /**< \brief [6:6] External Event Flag of Channel 6 (rh) */
    unsigned int INTF7:1;                   /**< \brief [7:7] External Event Flag of Channel 7 (rh) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_SCU_EIFR_Bits;

/** \\brief  Emergency Stop Register */
typedef struct _Ifx_SCU_EMSR_Bits
{
    unsigned int POL:1;                     /**< \brief [0:0] Input Polarity (rw) */
    unsigned int MODE:1;                    /**< \brief [1:1] Mode Selection (rw) */
    unsigned int ENON:1;                    /**< \brief [2:2] Enable ON (rw) */
    unsigned int PSEL:1;                    /**< \brief [3:3] PORT Select (rw) */
    unsigned int reserved_4:12;             /**< \brief \internal Reserved */
    unsigned int EMSF:1;                    /**< \brief [16:16] Emergency Stop Flag (rh) */
    unsigned int SEMSF:1;                   /**< \brief [17:17] SMU Emergency Stop Flag (rh) */
    unsigned int reserved_18:6;             /**< \brief \internal Reserved */
    unsigned int EMSFM:2;                   /**< \brief [25:24] Emergency Stop Flag Modification (w) */
    unsigned int SEMSFM:2;                  /**< \brief [27:26] SMU Emergency Stop Flag Modification (w) */
    unsigned int reserved_28:4;             /**< \brief \internal Reserved */
} Ifx_SCU_EMSR_Bits;

/** \\brief  ESR Input Configuration Register */
typedef struct _Ifx_SCU_ESRCFG_Bits
{
    unsigned int reserved_0:7;              /**< \brief \internal Reserved */
    unsigned int EDCON:2;                   /**< \brief [8:7] Edge Detection Control (rw) */
    unsigned int reserved_9:23;             /**< \brief \internal Reserved */
} Ifx_SCU_ESRCFG_Bits;

/** \\brief  ESR Output Configuration Register */
typedef struct _Ifx_SCU_ESROCFG_Bits
{
    unsigned int ARI:1;                     /**< \brief [0:0] Application Reset Indicator (rh) */
    unsigned int ARC:1;                     /**< \brief [1:1] Application Reset Indicator Clear (w) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_SCU_ESROCFG_Bits;

/** \\brief  EVR13 Control Register */
typedef struct _Ifx_SCU_EVR13CON_Bits
{
    unsigned int reserved_0:28;             /**< \brief \internal Reserved */
    unsigned int EVR13OFF:1;                /**< \brief [28:28] EVR13 Regulator Enable (rw) */
    unsigned int BPEVR13OFF:1;              /**< \brief [29:29] Bit Protection EVR13OFF (w) */
    unsigned int reserved_30:1;             /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVR13CON_Bits;

/** \\brief  EVR33 Control Register */
typedef struct _Ifx_SCU_EVR33CON_Bits
{
    unsigned int reserved_0:28;             /**< \brief \internal Reserved */
    unsigned int EVR33OFF:1;                /**< \brief [28:28] EVR33 Regulator Enable (rw) */
    unsigned int BPEVR33OFF:1;              /**< \brief [29:29] Bit Protection EVR33OFF (w) */
    unsigned int reserved_30:1;             /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVR33CON_Bits;

/** \\brief  EVR ADC Status Register */
typedef struct _Ifx_SCU_EVRADCSTAT_Bits
{
    unsigned int ADC13V:8;                  /**< \brief [7:0] ADC 1.3 V Conversion Result (rh) */
    unsigned int ADC33V:8;                  /**< \brief [15:8] ADC 3.3 V Conversion Result (rh) */
    unsigned int ADCSWDV:8;                 /**< \brief [23:16] ADC External Supply Conversion Result (rh) */
    unsigned int reserved_24:7;             /**< \brief \internal Reserved */
    unsigned int VAL:1;                     /**< \brief [31:31] Valid Status (rh) */
} Ifx_SCU_EVRADCSTAT_Bits;

/** \\brief  EVR Status Register for Voltage Scaling */
typedef struct _Ifx_SCU_EVRDVSTAT_Bits
{
    unsigned int DVS13TRIM:8;               /**< \brief [7:0] 1.3 V Regulator Voltage Trim Status (rh) */
    unsigned int reserved_8:8;              /**< \brief \internal Reserved */
    unsigned int DVS33TRIM:8;               /**< \brief [23:16] 3.3 V Regulator Voltage Trim Status (rh) */
    unsigned int reserved_24:7;             /**< \brief \internal Reserved */
    unsigned int VAL:1;                     /**< \brief [31:31] Valid Status (rh) */
} Ifx_SCU_EVRDVSTAT_Bits;

/** \\brief  EVR Monitor Control Register */
typedef struct _Ifx_SCU_EVRMONCTRL_Bits
{
    unsigned int EVR13OVMOD:2;              /**< \brief [1:0] 1.3 V Regulator Over-voltage monitoring mode (rw) */
    unsigned int reserved_2:2;              /**< \brief \internal Reserved */
    unsigned int EVR13UVMOD:2;              /**< \brief [5:4] 1.3 V Regulator Under-voltage monitoring mode (rw) */
    unsigned int reserved_6:2;              /**< \brief \internal Reserved */
    unsigned int EVR33OVMOD:2;              /**< \brief [9:8] 3.3 V Regulator Over-voltage monitoring mode (rw) */
    unsigned int reserved_10:2;             /**< \brief \internal Reserved */
    unsigned int EVR33UVMOD:2;              /**< \brief [13:12] 3.3 V Regulator Under-voltage monitoring mode (rw) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int SWDOVMOD:2;                /**< \brief [17:16] Supply monitor (SWD) Over-voltage monitoring mode (rw) */
    unsigned int reserved_18:2;             /**< \brief \internal Reserved */
    unsigned int SWDUVMOD:2;                /**< \brief [21:20] Supply monitor (SWD) Under-voltage monitoring mode (rw) */
    unsigned int reserved_22:10;            /**< \brief \internal Reserved */
} Ifx_SCU_EVRMONCTRL_Bits;

