HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxScu_regdef.h
/** \\brief  EVR Oscillator & Bandgap Register */
typedef struct _Ifx_SCU_EVROSCCTRL_Bits
{
    unsigned int OSCTRIM:10;                /**< \brief [9:0] OSC Trim Value (rw) */
    unsigned int OSCPTAT:6;                 /**< \brief [15:10] OSC PTAT Trim Value (rw) */
    unsigned int OSCANASEL:4;               /**< \brief [19:16] OSC ANASEL Value (rw) */
    unsigned int HPBGTRIM:7;                /**< \brief [26:20] High Precision Bandgap Trim Value (rw) */
    unsigned int HPBGCLKEN:1;               /**< \brief [27:27] High Precision Bandgap Clock Enable (rw) */
    unsigned int OSC3V3:1;                  /**< \brief [28:28] Oscillator 3V3 Mode (rw) */
    unsigned int reserved_29:2;             /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVROSCCTRL_Bits;

/** \\brief  EVR Over-voltage Configuration Register */
typedef struct _Ifx_SCU_EVROVMON_Bits
{
    unsigned int EVR13OVVAL:8;              /**< \brief [7:0] 1.3 V Regulator Over-voltage threshold (rw) */
    unsigned int EVR33OVVAL:8;              /**< \brief [15:8] 3.3 V Regulator Over-voltage threshold (rw) */
    unsigned int SWDOVVAL:8;                /**< \brief [23:16] Supply monitor (SWD) Over-voltage threshold value (rw) */
    unsigned int reserved_24:7;             /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVROVMON_Bits;

/** \\brief  EVR Reset Control Register */
typedef struct _Ifx_SCU_EVRRSTCON_Bits
{
    unsigned int RST13TRIM:8;               /**< \brief [7:0] 1.3 V Regulator Reset Trim Value (rw) */
    unsigned int reserved_8:16;             /**< \brief \internal Reserved */
    unsigned int RST13OFF:1;                /**< \brief [24:24] EVR13 Reset Enable (rw) */
    unsigned int BPRST13OFF:1;              /**< \brief [25:25] Bit Protection RST13OFF (w) */
    unsigned int RST33OFF:1;                /**< \brief [26:26] EVR33 Reset Enable (rw) */
    unsigned int BPRST33OFF:1;              /**< \brief [27:27] Bit Protection RST33OFF (w) */
    unsigned int RSTSWDOFF:1;               /**< \brief [28:28] EVR SWD Reset Enable (rw) */
    unsigned int BPRSTSWDOFF:1;             /**< \brief [29:29] Bit Protection RSTSWDOFF (w) */
    unsigned int reserved_30:1;             /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRRSTCON_Bits;

/** \\brief  EVR13 SD Coefficient Register 1 */
typedef struct _Ifx_SCU_EVRSDCOEFF1_Bits
{
    unsigned int SD5P:8;                    /**< \brief [7:0] P Coefficient (rw) */
    unsigned int SD5I:8;                    /**< \brief [15:8] I Coefficient (rw) */
    unsigned int SD5D:8;                    /**< \brief [23:16] D Coefficient (rw) */
    unsigned int reserved_24:7;             /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRSDCOEFF1_Bits;

/** \\brief  EVR13 SD Coefficient Register 2 */
typedef struct _Ifx_SCU_EVRSDCOEFF2_Bits
{
    unsigned int SD33P:8;                   /**< \brief [7:0] P Coefficient (rw) */
    unsigned int SD33I:8;                   /**< \brief [15:8] I Coefficient (rw) */
    unsigned int SD33D:8;                   /**< \brief [23:16] D Coefficient (rw) */
    unsigned int reserved_24:7;             /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRSDCOEFF2_Bits;

/** \\brief  EVR13 SD Coefficient Register 3 */
typedef struct _Ifx_SCU_EVRSDCOEFF3_Bits
{
    unsigned int CT5REG0:8;                 /**< \brief [7:0] Commutation trimming (rw) */
    unsigned int CT5REG1:8;                 /**< \brief [15:8] Commutation trimming (rw) */
    unsigned int CT5REG2:8;                 /**< \brief [23:16] Commutation trimming (rw) */
    unsigned int reserved_24:7;             /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRSDCOEFF3_Bits;

/** \\brief  EVR13 SD Coefficient Register 4 */
typedef struct _Ifx_SCU_EVRSDCOEFF4_Bits
{
    unsigned int CT5REG3:8;                 /**< \brief [7:0] Commutation trimming (rw) */
    unsigned int CT5REG4:8;                 /**< \brief [15:8] Commutation trimming (rw) */
    unsigned int reserved_16:15;            /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRSDCOEFF4_Bits;

/** \\brief  EVR13 SD Coefficient Register 5 */
typedef struct _Ifx_SCU_EVRSDCOEFF5_Bits
{
    unsigned int CT33REG0:8;                /**< \brief [7:0] Commutation trimming (rw) */
    unsigned int CT33REG1:8;                /**< \brief [15:8] Commutation trimming (rw) */
    unsigned int CT33REG2:8;                /**< \brief [23:16] Commutation trimming (rw) */
    unsigned int reserved_24:7;             /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRSDCOEFF5_Bits;

/** \\brief  EVR13 SD Coefficient Register 6 */
typedef struct _Ifx_SCU_EVRSDCOEFF6_Bits
{
    unsigned int CT33REG3:8;                /**< \brief [7:0] Commutation trimming (rw) */
    unsigned int CT33REG4:8;                /**< \brief [15:8] Commutation trimming (rw) */
    unsigned int reserved_16:15;            /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRSDCOEFF6_Bits;

/** \\brief  EVR13 SD Control Register 1 */
typedef struct _Ifx_SCU_EVRSDCTRL1_Bits
{
    unsigned int SDFREQSPRD:16;             /**< \brief [15:0] Frequency Spread Threshold (rw) */
    unsigned int SDFREQ:8;                  /**< \brief [23:16] Regulator Switching Frequency (rw) */
    unsigned int SDSTEP:4;                  /**< \brief [27:24] Droop Voltage Step (rw) */
    unsigned int reserved_28:2;             /**< \brief \internal Reserved */
    unsigned int SDSAMPLE:1;                /**< \brief [30:30] ADC Sampling Scheme (rw) */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRSDCTRL1_Bits;

/** \\brief  EVR13 SD Control Register 2 */
typedef struct _Ifx_SCU_EVRSDCTRL2_Bits
{
    unsigned int DRVP:8;                    /**< \brief [7:0] P-Driver Setting (rw) */
    unsigned int SDMINMAXDC:8;              /**< \brief [15:8] Minimum Duty Cycle (rw) */
    unsigned int DRVN:8;                    /**< \brief [23:16] N-Driver Setting (rw) */
    unsigned int SDLUT:6;                   /**< \brief [29:24] Non-linear Starting Point (rw) */
    unsigned int reserved_30:1;             /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRSDCTRL2_Bits;

